# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'
tap 'shivammathur/php'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.1'
brew 'php@7.4'
brew 'shivammathur/php/php@7.1'
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@5.6'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'cleanmymac'
cask 'clockify'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'evernote'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hazel'
cask 'homebrew/cask-drivers/elgato-stream-deck'
cask 'imageoptim'
cask 'insomnia'
cask 'jdownloader'
cask 'meetingbar'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'microsoft-teams'
cask 'moom'
cask 'moneymoney'
cask 'onedrive'
cask 'opera'
cask 'phpstorm'
cask 'postman'
cask 'ray'
cask 'screenflow'
cask 'signal'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'todoist'
cask 'transmit'
cask 'tunnelbear'
cask 'typinator'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Tweetbot', id: 1384080005
mas 'Day One', id: 1055511498
